 tand: proc(arg) returns(float bin(24));
 dcl arg         float bin(24);
 dcl temp        float bin(24);
 temp = cosd(arg);
 if temp = 0 then
    signal error(3);
 return(sind(arg)/temp);
 end tand;
