 tanh: proc(arg) returns(float bin(24));
 dcl arg         float bin(24);
 dcl (tempp, tempm) float bin(24);
 tempp = exp(arg);
 tempm = exp(-arg);
 return((tempp-tempm)/(tempp+tempm));
 end tanh;
